vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/components/i3c_bus/fsl_component_i3c.c
static status_t I3C_BusMasterGetBCR(i3c_device_t *master, i3c_device_information_t *info)
{
    uint8_t bcr;
    i3c_ccc_cmd_t getBCRCmd = {0};
    status_t result         = kStatus_Success;

    getBCRCmd.isRead   = true;
    getBCRCmd.cmdId    = I3C_BUS_CCC_GETBCR;
    getBCRCmd.destAddr = info->dynamicAddr;
    getBCRCmd.data     = &bcr;
    getBCRCmd.dataSize = 1U;

    result = I3C_BusMasterSendCCC(master, &getBCRCmd);

    info->bcr = bcr;

    return result;
}

static status_t I3C_BusMasterGetDCR(i3c_device_t *master, i3c_device_information_t *info)
{
    uint8_t dcr;
    i3c_ccc_cmd_t getDCRCmd = {0};
    status_t result         = kStatus_Success;

    getDCRCmd.isRead   = true;
    getDCRCmd.cmdId    = I3C_BUS_CCC_GETDCR;
    getDCRCmd.destAddr = info->dynamicAddr;
    getDCRCmd.data     = &dcr;
    getDCRCmd.dataSize = 1U;

    result = I3C_BusMasterSendCCC(master, &getDCRCmd);

    info->dcr = dcr;

    return result;
}

static status_t I3C_BusMasterAssignDevDynamicAddr(i3c_device_t *masterDev)
{
    i3c_bus_t *i3cBus = masterDev->bus;
    status_t result   = kStatus_Success;

    list_handle_t i3cDevList = &(i3cBus->i3cDevList);

    for (list_element_handle_t listItem = i3cDevList->head; listItem != NULL; listItem = listItem->next)
    {
        i3c_device_t *tmpDev = (i3c_device_t *)(void *)listItem;
        if (tmpDev == masterDev)
        {
            continue;
        }
        else if ((tmpDev->initDynamicAddr != 0U) && (tmpDev->info.staticAddr != 0U) && (tmpDev->info.dynamicAddr == 0U))
        {
            result =
                I3C_BusMasterSetDynamicAddrFromStaticAddr(masterDev, tmpDev->info.staticAddr, tmpDev->initDynamicAddr);

            if (result != kStatus_Success)
            {
                return result;
            }

            tmpDev->info.dynamicAddr = tmpDev->initDynamicAddr;
            I3C_BusSetAddrSlot(i3cBus, tmpDev->info.dynamicAddr, kI3C_Bus_AddrSlot_I3CDev);

            /* Retrieve device information. */
            result = I3C_BusMasterGetDeviceInfo(masterDev, tmpDev->info.dynamicAddr, &tmpDev->info);
            if (result != kStatus_Success)
            {
                return result;
            }
        }
        else
        {
            /*Empty else to eliminate MISRA 15.7*/
        }
    }

    return result;
}

static status_t I3C_BusMasterAddExistingI3CDevs(i3c_device_t *masterDev)
{
    i3c_bus_t *i3cBus = masterDev->bus;
    status_t result   = kStatus_Success;

    list_handle_t i3cDevList = &(i3cBus->i3cDevList);

    for (list_element_handle_t listItem = i3cDevList->head; listItem != NULL; listItem = listItem->next)
    {
        i3c_device_t *tmpDev = (i3c_device_t *)(void *)listItem;
        if (tmpDev == masterDev)
        {
            continue;
        }
        else if (tmpDev->ibiInfo != NULL)
        {
            result = I3C_BusMasterRegisterDevIBI(masterDev, tmpDev, tmpDev->ibiInfo);
            if (result != kStatus_Success)
            {
                return result;
            }
        }
        else
        {
            /*Fix MISRA violation 15.7*/
        }
    }

    return result;
}

/*!
 * brief Add exist I3C device in bus to the bus device list.
 *
 * This function will simply add the device to the bus device list and set the related address slot.
 *
 * param bus Pointer to bus structure.
 * param dev Pointer to I3C device.
 */
void I3C_BusAddI3CDev(i3c_bus_t *bus, i3c_device_t *dev)
{
    /* Chain device into i3c_device_list */
    list_handle_t i3cDevList = &bus->i3cDevList;
    (void)LIST_AddTail(i3cDevList, &dev->listNode);

    if (dev->info.dynamicAddr != 0U)
    {
        /* Set slot status I3C device */
        I3C_BusSetAddrSlot(bus, dev->info.dynamicAddr, kI3C_Bus_AddrSlot_I3CDev);
    }

    if (dev->info.staticAddr != 0U)
    {
        /* Set slot status I2C device */
        I3C_BusSetAddrSlot(bus, dev->info.staticAddr, kI3C_Bus_AddrSlot_I2CDev);
    }

    dev->bus = bus;
}

/*!
 * brief Add exist I2C device in bus to the bus device list.
 *
 * This function will simply add the device to the bus device list and set the related address slot.
 *
 * param bus Pointer to bus structure.
 * param dev Pointer to I2C device.
 */
void I3C_BusAddI2CDev(i3c_bus_t *bus, i2c_device_t *dev)
{
    /* Chain device into i2c_device_list */
    dev->bus                 = bus;
    list_handle_t i2cDevList = &bus->i2cDevList;
    (void)LIST_AddTail(i2cDevList, &dev->listNode);
    /* Set slot status I2C device */
    I3C_BusSetAddrSlot(bus, dev->staticAddr, kI3C_Bus_AddrSlot_I2CDev);
    dev->bus = bus;
}

/*!
 * brief Get valid address slot in the I3C bus.
 *
 * This function will search for available address lot in the I3C bus address pool, the search starts from
 * the startAddr specified by user input, to end address defined in @ref I3C_BUS_MAX_ADDR. Will return the
 * available address if the related address slot is valid.
 *
 * param bus Pointer to bus structure.
 * param startAddr Start address for address slot searching, end address is defined in @ref I3C_BUS_MAX_ADDR.
 * return Available address in the bus address pool.
 */
uint8_t I3C_BusGetValidAddrSlot(i3c_bus_t *bus, uint8_t startAddr)
{
    uint8_t validAddr = 0xFF;

    for (validAddr = startAddr; validAddr < I3C_BUS_MAX_ADDR; validAddr++)
    {
        if (I3C_BusGetAddrSlotStatus(bus, validAddr) == (uint8_t)kI3C_Bus_AddrSlot_Free)
        {
            return validAddr;
        }
    }

    return validAddr;
}

/*!
 * brief Gets the default configuration structure.
 *
 * This function initializes the bus configuration structure to a default value. The default
 * values are:
 *   busConfig->busMode = kI3C_Bus_PureMode;
 *   busConfig->i2cBaudRate = 400000U;
 *   busConfig->i3cOpenDrainBaudRate = 1500000U;
 *   busConfig->i3cPushPullBaudRate = 4000000U;
 *
 * param config Pointer to a configuration structure.
 */
void I3C_BusGetDefaultBusConfig(i3c_bus_config_t *busConfig)
{
    busConfig->busMode              = kI3C_Bus_PureMode;
    busConfig->i2cBaudRate          = 400000U;
    busConfig->i3cOpenDrainBaudRate = 1500000U;
    busConfig->i3cPushPullBaudRate  = 4000000U;
}

/*!
 * brief Creates I3C bus structure.
 *
 * This function creates the bus structure with input bus configuration. Address pool set up and device
 * list initialize process will be also done in this function call.
 *
 * param bus Pointer to bus structure.
 * param busConfig Pointer to the bus configuration structure.
 */
void I3C_BusCreate(i3c_bus_t *bus, const i3c_bus_config_t *busConfig)
{
    assert(bus != NULL);

    (void)memset(bus, 0, sizeof(*bus));

    LIST_Init(&bus->i2cDevList, 0);
    LIST_Init(&bus->i3cDevList, 0);
    I3C_BusInitAddrSlots(bus);
    bus->busMode              = busConfig->busMode;
    bus->i2cBaudRate          = busConfig->i2cBaudRate;
    bus->i3cOpenDrainBaudRate = busConfig->i3cOpenDrainBaudRate;
    bus->i3cPushPullBaudRate  = busConfig->i3cPushPullBaudRate;
}

/*!
 * brief Create I3C master structure on bus.
 *
 * This function will create I3C master bus structure, initialize the master according to bus characteristics, install
 * device information and device control information.
 *
 * param masterDev Pointer to device structure creating as master.
 * param bus Pointer to bus structure.
 * param devInfo Pointer to device information structure.
 * param masterControlInfo Pointer to master control information structure.
 */
status_t I3C_BusMasterCreate(i3c_device_t *masterDev,
                             i3c_bus_t *bus,
                             i3c_device_information_t *devInfo,
                             i3c_device_control_info_t *masterControlInfo)
{
    status_t result = kStatus_Success;

    (void)memset(masterDev, 0, sizeof(*masterDev));

    masterDev->info = *devInfo;
    result          = I3C_CheckBusMasterOps(masterControlInfo->funcs);

    if (result != kStatus_Success)
    {
        return result;
    }

    masterDev->devControlInfo = masterControlInfo;
    masterDev->bus            = bus;

