vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/components/i3c_bus/fsl_component_i3c.c
    /* call master init to initialize master */
    result = masterControlInfo->funcs->Init(masterDev);

    if (result != kStatus_Success)
    {
        return result;
    }

    if (!masterControlInfo->isSecondary)
    {
        bus->currentMaster = masterDev;
        /* Add masterDev to bus i3c device list */
        I3C_BusAddI3CDev(bus, masterDev);

        /* Execute reset DAA CCC command to reset all i3c device dynamic address */
        result = I3C_BusMasterResetDAA(masterDev, I3C_BUS_BROADCAST_ADDR);
        if (result != kStatus_Success)
        {
            return result;
        }

        /* Master assign slave with init dynamic address. */
        result = I3C_BusMasterAssignDevDynamicAddr(masterDev);
        if (result != kStatus_Success)
        {
            return result;
        }

        result = I3C_BusMasterAddExistingI3CDevs(masterDev);
        if (result != kStatus_Success)
        {
            return result;
        }

        /* Disable all events before start doing DAA. */
        result = I3C_BusMasterDisableEvents(masterDev, I3C_BUS_BROADCAST_ADDR,
                                            ((uint8_t)kI3C_EventMR | (uint8_t)kI3C_EventHJ | (uint8_t)kI3C_EventIBI));
        if (result != kStatus_Success)
        {
            return result;
        }

        /* Start to do DAA */
        result = I3C_BusMasterDoDAA(masterDev);
        if (result != kStatus_Success)
        {
            return result;
        }

        /* Enable all events. */
        result = I3C_BusMasterEnableEvents(masterDev, I3C_BUS_BROADCAST_ADDR,
                                           ((uint8_t)kI3C_EventMR | (uint8_t)kI3C_EventHJ | (uint8_t)kI3C_EventIBI));
        if (result != kStatus_Success)
        {
            return result;
        }
    }

    return result;
}

/*!
 * brief Bus master transfer CCC frame.
 *
 * Bus master call this function to transfer CCC frame, CCC frame command and data is prepared in @ref i3c_ccc_cmd_t
 * structure.
 *
 * param masterDev Pointer to I3C master device.
 * param command Pointer to ccc frame.
 */
status_t I3C_BusMasterSendCCC(i3c_device_t *masterDev, i3c_ccc_cmd_t *command)
{
    i3c_device_control_info_t *masterControlInfo = masterDev->devControlInfo;

    if (masterDev != masterDev->bus->currentMaster)
    {
        return kStatus_I3CBus_NotCurrentMaster;
    }

    if (masterControlInfo->isSecondary)
    {
        return kStatus_I3CBus_Success;
    }

    if (NULL == masterControlInfo->funcs->TransmitCCC)
    {
        return kStatus_I3CBus_MasterOpsUnsupport;
    }

    return masterControlInfo->funcs->TransmitCCC(masterDev, command);
}

/*!
 * brief Bus master reset dynamic assigned address.
 *
 * Bus master call this function to reset dynamic assigned address, the operation could be done to all connected I3C
 * devices by using slave address I3C_BUS_BROADCAST_ADDR or to a specific connected device by using the device's dynamic
 * address.
 *
 * param masterDev Pointer to I3C master device.
 * param slaveAddr Slave address, use I3C_BUS_BROADCAST_ADDR as broadcast address.
 */
status_t I3C_BusMasterResetDAA(i3c_device_t *masterDev, uint8_t slaveAddr)
{
    i3c_bus_t *i3cBus = masterDev->bus;
    uint8_t addrStat;
    status_t result;

    if (masterDev != masterDev->bus->currentMaster)
    {
        return kStatus_I3CBus_NotCurrentMaster;
    }

    addrStat = I3C_BusGetAddrSlotStatus(i3cBus, slaveAddr);
    if ((slaveAddr != I3C_BUS_BROADCAST_ADDR) && (addrStat != (uint8_t)kI3C_Bus_AddrSlot_I3CDev))
    {
        return kStatus_I3CBus_MasterOpsFailure;
    }

    i3c_ccc_cmd_t rstDaaCmd = {0};

    rstDaaCmd.isRead   = false;
    rstDaaCmd.destAddr = slaveAddr;
    rstDaaCmd.cmdId    = I3C_BUS_CCC_RSTDAA((slaveAddr != I3C_BUS_BROADCAST_ADDR));

    result = I3C_BusMasterSendCCC(masterDev, &rstDaaCmd);
    if (result == kStatus_Success)
    {
        if (slaveAddr != I3C_BUS_BROADCAST_ADDR)
        {
            /* Do not free current Controller's dynamic address. */
            if (masterDev->info.dynamicAddr != slaveAddr)
            {
                I3C_BusSetAddrSlot(i3cBus, slaveAddr, kI3C_Bus_AddrSlot_Free);
            }
        }
        else
        {
            for (uint8_t i = 0; i <= I3C_BUS_MAX_ADDR; i++)
            {
                addrStat = I3C_BusGetAddrSlotStatus(i3cBus, i);
                if ((addrStat == (uint8_t)kI3C_Bus_AddrSlot_I3CDev) && (masterDev->info.dynamicAddr != i))
                {
                    I3C_BusSetAddrSlot(i3cBus, i, kI3C_Bus_AddrSlot_Free);
                }
            }
        }
    }

    return result;
}

/*!
 * brief Bus master do dynamic address assignment.
 *
 * Bus master call this function to do dynamic address assignment to the I3C devices connected on bus.
 *
 * param masterDev Pointer to I3C master device.
 */
status_t I3C_BusMasterDoDAA(i3c_device_t *masterDev)
{
    i3c_device_control_info_t *masterControlInfo = masterDev->devControlInfo;
    i3c_bus_t *i3cBus                            = masterDev->bus;
    status_t result                              = kStatus_Success;

    if (masterDev != i3cBus->currentMaster)
    {
        return kStatus_I3CBus_NotCurrentMaster;
    }

    result = masterControlInfo->funcs->ProceedDAA(masterDev);
    if (result != kStatus_Success)
    {
        return result;
    }

    /* Send defslvs command on bus if there's secondary master */
    bool isSend              = false;
    list_handle_t i3cDevList = &(i3cBus->i3cDevList);

    for (list_element_handle_t listItem = i3cDevList->head; listItem != NULL; listItem = listItem->next)
    {
        i3c_device_t *tmpDev = (i3c_device_t *)(void *)listItem;
        if (tmpDev == masterDev)
        {
            continue;
        }
        else if ((tmpDev->info.bcr & I3C_BUS_DEV_BCR_DEV_ROLE_MASK) ==
                 I3C_BUS_DEV_BCR_DEV_ROLE(I3C_BUS_DEV_BCR_DEV_MASTER))
        {
            isSend = true;
            break;
        }
        else
        {
            /*Empty else to eliminate MISRA 15.7*/
        }
    }

