vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/components/i3c_bus/fsl_component_i3c.c
    if (isSend)
    {
        result = I3C_BusMasterSendSlavesList(masterDev);
    }

    return result;
}

/*!
 * brief Bus master set device dynamic address from static address.
 *
 * Bus master call this function to execute SETDASA CCC command to set device dynamic address from static address.
 *
 * param masterDev Pointer to I3C master device.
 * param staticAddr Device static address.
 * param initDynamicAddr Device initialized dynamic address.
 */
status_t I3C_BusMasterSetDynamicAddrFromStaticAddr(i3c_device_t *master, uint8_t staticAddr, uint8_t initDynamicAddr)
{
    i3c_ccc_cmd_t setdasaCCC = {0};
    status_t result          = kStatus_Success;
    uint8_t dynamicAddr      = initDynamicAddr << 1;

    setdasaCCC.cmdId    = I3C_BUS_CCC_SETDASA;
    setdasaCCC.destAddr = staticAddr;
    setdasaCCC.data     = &dynamicAddr;
    setdasaCCC.dataSize = 1U;
    setdasaCCC.isRead   = false;

    result = I3C_BusMasterSendCCC(master, &setdasaCCC);

    return result;
}

/*!
 * brief Bus master send slave list on bus.
 *
 * Bus master call this function to send slave list on bus to notify the secondary master.
 *
 * param masterDev Pointer to I3C master device.
 */
status_t I3C_BusMasterSendSlavesList(i3c_device_t *masterDev)
{
    i3c_bus_t *i3cBus = masterDev->bus;

    if (masterDev != i3cBus->currentMaster)
    {
        return kStatus_I3CBus_NotCurrentMaster;
    }

    list_element_handle_t listItem;
    list_handle_t i2cDevList = &(i3cBus->i2cDevList);
    list_handle_t i3cDevList = &(i3cBus->i3cDevList);

    i3c_ccc_cmd_t defSlavesCmd = {0};
    defSlavesCmd.isRead        = false;
    defSlavesCmd.destAddr      = I3C_BUS_BROADCAST_ADDR;
    defSlavesCmd.cmdId         = I3C_BUS_CCC_DEFSLVS;
    uint8_t devCount           = 1;
    status_t result            = kStatus_Success;

    for (listItem = i2cDevList->head; listItem != NULL; listItem = listItem->next)
    {
        devCount++;
    }

    for (listItem = i3cDevList->head; listItem != NULL; listItem = listItem->next)
    {
        i3c_device_t *i3cDev = (i3c_device_t *)(void *)listItem;
        if (i3cDev == masterDev)
        {
            continue;
        }
        else
        {
            devCount++;
        }
    }

    defSlavesCmd.dataSize = (uint16_t)sizeof(i3c_ccc_dev_t) * (uint16_t)devCount + 1U;
    defSlavesCmd.data     = malloc(defSlavesCmd.dataSize);

    uint8_t *pData = defSlavesCmd.data;

    *pData                    = devCount;
    i3c_ccc_dev_t *masterInfo = (i3c_ccc_dev_t *)(void *)&pData[1];
    masterInfo->bcr           = masterDev->info.bcr;
    masterInfo->dcr           = masterDev->info.dcr;
    masterInfo->dynamicAddr   = masterDev->info.dynamicAddr << 1U;
    masterInfo->staticAddr    = (I3C_BUS_BROADCAST_ADDR << 1U);

    i3c_ccc_dev_t *slaveInfo = (i3c_ccc_dev_t *)((uint32_t)&pData[1] + sizeof(i3c_ccc_dev_t));
    for (listItem = i2cDevList->head; listItem != NULL; listItem = listItem->next)
    {
        slaveInfo->lvr        = ((i2c_device_t *)(void *)listItem)->lvr;
        slaveInfo->staticAddr = (((i2c_device_t *)(void *)listItem)->staticAddr << 1U);
        slaveInfo++;
    }

    for (listItem = i3cDevList->head; listItem != NULL; listItem = listItem->next)
    {
        i3c_device_t *i3cDev = (i3c_device_t *)(void *)listItem;
        if (i3cDev == masterDev)
        {
            continue;
        }

        slaveInfo->dcr         = i3cDev->info.dcr;
        slaveInfo->dynamicAddr = i3cDev->info.dynamicAddr << 1U;
        slaveInfo->bcr         = i3cDev->info.bcr;
        slaveInfo->staticAddr  = i3cDev->info.staticAddr << 1U;
        slaveInfo++;
    }

    result = I3C_BusMasterSendCCC(masterDev, &defSlavesCmd);

    free(defSlavesCmd.data);

    return result;
}

/*!
 * brief Bus master enable events.
 *
 * Bus master call this function to enable events on bus.
 *
 * param masterDev Pointer to I3C master device.
 * param slaveAddr Slave address, use I3C_BUS_BROADCAST_ADDR as broadcast address.
 * param busEvents Logic OR or member in @ref _i3c_bus_events.
 */
status_t I3C_BusMasterEnableEvents(i3c_device_t *masterDev, uint8_t slaveAddr, uint8_t busEvents)
{
    i3c_ccc_cmd_t enEventsCmd = {0};
    status_t result           = kStatus_Success;

    enEventsCmd.isRead   = false;
    enEventsCmd.cmdId    = I3C_BUS_CCC_ENEC((slaveAddr != I3C_BUS_BROADCAST_ADDR));
    enEventsCmd.destAddr = slaveAddr;
    enEventsCmd.data     = &busEvents;
    enEventsCmd.dataSize = 1U;

    result = I3C_BusMasterSendCCC(masterDev, &enEventsCmd);

    return result;
}

/*!
 * brief Bus master disable events.
 *
 * Bus master call this function to disable events on bus.
 *
 * param masterDev Pointer to I3C master device.
 * param slaveAddr Slave address, use I3C_BUS_BROADCAST_ADDR as broadcast address.
 * param busEvents Logic OR or member in @ref _i3c_bus_events.
 */
status_t I3C_BusMasterDisableEvents(i3c_device_t *masterDev, uint8_t slaveAddr, uint8_t busEvents)
{
    i3c_ccc_cmd_t disEventsCmd = {0};
    status_t result            = kStatus_Success;

    disEventsCmd.isRead   = false;
    disEventsCmd.cmdId    = I3C_BUS_CCC_DISEC((slaveAddr != I3C_BUS_BROADCAST_ADDR));
    disEventsCmd.destAddr = slaveAddr;
    disEventsCmd.data     = &busEvents;
    disEventsCmd.dataSize = 1U;

    result = I3C_BusMasterSendCCC(masterDev, &disEventsCmd);

    return result;
}

/*!
 * brief Bus master get device information for a specific I3C device.
 *
 * Bus master call this function to get device information for a specific I3C device.
 *
 * param masterDev Pointer to I3C master device.
 * param slaveAddr Slave address, dynamic assigned address for a device.
 * param devInfo Input pointer to structure i3c_device_information_t to store the read out device information.
 */
status_t I3C_BusMasterGetDeviceInfo(i3c_device_t *masterDev, uint8_t slaveAddr, i3c_device_information_t *devInfo)
{
    status_t result = kStatus_Success;

    devInfo->dynamicAddr = slaveAddr;

    result = I3C_BusMasterGetPID(masterDev, devInfo);
    if (result != kStatus_Success)
    {
        return result;
    }

    result = I3C_BusMasterGetBCR(masterDev, devInfo);
    if (result != kStatus_Success)
    {
        return result;
    }

    result = I3C_BusMasterGetDCR(masterDev, devInfo);
    if (result != kStatus_Success)
    {
        return result;
    }

    result = I3C_BusMasterGetMaxReadLength(masterDev, devInfo);
    if (result != kStatus_Success)
    {
        return result;
    }
    result = I3C_BusMasterGetMaxWriteLength(masterDev, devInfo);
    if (result != kStatus_Success)
    {
        return result;
    }

    if ((devInfo->bcr & I3C_BUS_DEV_BCR_MODE_MASK) != 0U)
    {
        result = I3C_BusMasterGetHDRCapability(masterDev, devInfo);
        if (result != kStatus_Success)
        {
            return result;
        }
    }

    return result;
}

status_t I3C_BusMasterRegisterDevIBI(i3c_device_t *masterDev, i3c_device_t *i3cDev, i3c_device_ibi_info_t *devIbiInfo)
{
    i3c_bus_t *i3cBus = masterDev->bus;

    if (masterDev != i3cBus->currentMaster)
    {
        return kStatus_I3CBus_NotCurrentMaster;
    }

    i3c_device_control_info_t *masterControlInfo = masterDev->devControlInfo;
    i3cDev->ibiInfo                              = devIbiInfo;

